hello = ["привет", "прив", "хай", "здравствуйте", "здравствуй", "здрасти", "здорово", "здоровенько"]
how_you = ["как дела?", "как ты?", "чё как?", "как оно?" "как настроение?", "как настрой?"]
bye = ["пока", "до встречи", "удачи", "до скорого", "прощай", "гудбай", "чао" "чао бомбино", "покеда", "покедова"]

none_text = ["", " "]

ans_hello = ["и тебе привет", "о привет давно не виделись", "ну привет коль не шутишь", "привет дружище", "слава богу ты пришёл"]
ans_how_you = ["отлично", "хорошо", "нормально", "плохо", "неплохо", "отвратительно", "ок", "всё окей", "лучше всех", "всё супер", "супер"]
ans_bye = ["и тебе пока", "ну давай бывай", "удачи тебе", "бывай дружище"]

if __name__ == "__main__":
    print("Подключите данный модуль к файлу")
    input("\nEnter")